In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /Users/carambolas/anaconda3/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: six in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (2.0.23)
Requirement already satisfied: ipython-genutils in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: matplotlib-inline in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: appnope in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.3)
Requirement already satisfied: pygments>=2.4.0 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pickleshare in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: traitlets>=5 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: pexpect>4.3 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: stack-data in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens in /Users/carambolas/anaconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///sqlite_db_pythonsqlite.db

In [4]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Bookings',), ('Facilities',), ('Members',)]

In [5]:
%%sql
SELECT * FROM Facilities LIMIT 5;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'Tennis Court 1', 5, 25, 10000, 200),
 (1, 'Tennis Court 2', 5, 25, 8000, 200),
 (2, 'Badminton Court', 0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0, 5, 320, 10),
 (4, 'Massage Room 1', 9.9, 80, 4000, 3000)]

In [6]:
%%sql
SELECT * FROM Bookings LIMIT 5;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 3, 1, '2012-07-03 11:00:00', 2),
 (1, 4, 1, '2012-07-03 08:00:00', 2),
 (2, 6, 0, '2012-07-03 18:00:00', 2),
 (3, 7, 1, '2012-07-03 19:00:00', 2),
 (4, 8, 1, '2012-07-03 10:00:00', 1)]

In [7]:
%%sql
SELECT * FROM Members LIMIT 5;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', '', '2012-07-01 00:00:00'),
 (1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', '', '2012-07-02 12:02:05'),
 (2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', '', '2012-07-02 12:08:23'),
 (3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', '', '2012-07-03 09:32:15'),
 (4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', '1', '2012-07-03 10:25:05')]

Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.

In [8]:
%%sql
SELECT name FROM Facilities WHERE membercost > 0;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

Q2:How many facilities do not charge a fee to members?

In [9]:
%%sql
SELECT COUNT(facid) FROM Facilities WHERE membercost = 0;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(4,)]

Q3:Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

In [10]:
%%sql
SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost > 0 AND membercost < (0.2 * monthlymaintenance);

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(0, 'Tennis Court 1', 5, 200),
 (1, 'Tennis Court 2', 5, 200),
 (4, 'Massage Room 1', 9.9, 3000),
 (5, 'Massage Room 2', 9.9, 3000),
 (6, 'Squash Court', 3.5, 80)]

Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

In [11]:
%%sql
SELECT *
FROM Facilities
WHERE facid IN (1,5);

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[(1, 'Tennis Court 2', 5, 25, 8000, 200),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000)]

Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

In [12]:
%%sql
SELECT name, monthlymaintenance,
CASE WHEN monthlymaintenance > 100 THEN 'expensive'
    WHEN monthlymaintenance < 100 THEN 'cheap'
    END AS label
FROM Facilities;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

In [13]:
%%sql
SELECT firstname, surname
FROM Members
WHERE joindate = (SELECT MAX(joindate) FROM Members);

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Darren', 'Smith')]

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name

In [14]:
%%sql
SELECT DISTINCT
    f.name || ' - ' || m.firstname || ' ' || m.surname AS court_and_member
FROM
    Bookings b
    JOIN Facilities f ON b.facid = f.facid
    JOIN Members m ON b.memid = m.memid
WHERE
    f.name LIKE 'Tennis Court%'
ORDER BY
    m.firstname, m.surname;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Tennis Court 1 - Anne Baker',),
 ('Tennis Court 2 - Anne Baker',),
 ('Tennis Court 2 - Burton Tracy',),
 ('Tennis Court 1 - Burton Tracy',),
 ('Tennis Court 1 - Charles Owen',),
 ('Tennis Court 2 - Charles Owen',),
 ('Tennis Court 2 - Darren Smith',),
 ('Tennis Court 1 - David Farrell',),
 ('Tennis Court 2 - David Farrell',),
 ('Tennis Court 2 - David Jones',),
 ('Tennis Court 1 - David Jones',),
 ('Tennis Court 1 - David Pinker',),
 ('Tennis Court 1 - Douglas Jones',),
 ('Tennis Court 1 - Erica Crumpet',),
 ('Tennis Court 2 - Florence Bader',),
 ('Tennis Court 1 - Florence Bader',),
 ('Tennis Court 2 - GUEST GUEST',),
 ('Tennis Court 1 - GUEST GUEST',),
 ('Tennis Court 1 - Gerald Butters',),
 ('Tennis Court 2 - Gerald Butters',),
 ('Tennis Court 2 - Henrietta Rumney',),
 ('Tennis Court 1 - Jack Smith',),
 ('Tennis Court 2 - Jack Smith',),
 ('Tennis Court 1 - Janice Joplette',),
 ('Tennis Court 2 - Janice Joplette',),
 ('Tennis Court 2 - Jemima Farrell',),
 ('Tennis Court 1 - Jemima Farrell',),
 ('Tennis Court 1 - Joan Coplin',),
 ('Tennis Court 1 - John Hunt',),
 ('Tennis Court 2 - John Hunt',),
 ('Tennis Court 1 - Matthew Genting',),
 ('Tennis Court 2 - Millicent Purview',),
 ('Tennis Court 2 - Nancy Dare',),
 ('Tennis Court 1 - Nancy Dare',),
 ('Tennis Court 2 - Ponder Stibbons',),
 ('Tennis Court 1 - Ponder Stibbons',),
 ('Tennis Court 2 - Ramnaresh Sarwin',),
 ('Tennis Court 1 - Ramnaresh Sarwin',),
 ('Tennis Court 2 - Tim Boothe',),
 ('Tennis Court 1 - Tim Boothe',),
 ('Tennis Court 2 - Tim Rownam',),
 ('Tennis Court 1 - Tim Rownam',),
 ('Tennis Court 2 - Timothy Baker',),
 ('Tennis Court 1 - Timothy Baker',),
 ('Tennis Court 1 - Tracy Smith',),
 ('Tennis Court 2 - Tracy Smith',)]

Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.

In [15]:
%%sql
SELECT
    f.name AS facility,
    CASE
        WHEN b.memid = 0 THEN 'Guest'
        ELSE m.firstname || ' ' || m.surname
    END AS member,
    CASE
        WHEN b.memid = 0 THEN f.guestcost * b.slots
        ELSE f.membercost * b.slots
    END AS cost
FROM
    Bookings b
    JOIN Facilities f ON b.facid = f.facid
    JOIN Members m ON b.memid = m.memid
WHERE
    b.starttime LIKE '2012-09-14%' AND
    (
        (b.memid = 0 AND f.guestcost * b.slots > 30) OR
        (b.memid != 0 AND f.membercost * b.slots > 30)
    )
ORDER BY
    cost DESC;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 2', 'Guest', 320),
 ('Massage Room 1', 'Guest', 160),
 ('Massage Room 1', 'Guest', 160),
 ('Massage Room 1', 'Guest', 160),
 ('Tennis Court 2', 'Guest', 150),
 ('Tennis Court 1', 'Guest', 75),
 ('Tennis Court 1', 'Guest', 75),
 ('Tennis Court 2', 'Guest', 75),
 ('Squash Court', 'Guest', 70.0),
 ('Massage Room 1', 'Jemima Farrell', 39.6),
 ('Squash Court', 'Guest', 35.0),
 ('Squash Court', 'Guest', 35.0)]

Q9: This time, produce the same result as in Q8, but using a subquery.

In [6]:
%%sql
SELECT
    f.name AS facility,
    m.firstname || ' ' || m.surname AS member,
    sub.cost
FROM (
    SELECT
        b.facid,
        b.memid,
        CASE
            WHEN b.memid = 0 THEN f.guestcost * b.slots
            ELSE f.membercost * b.slots
        END AS cost,
        b.starttime
    FROM
        Bookings b
        JOIN Facilities f ON b.facid = f.facid
    WHERE
        b.starttime LIKE '2012-09-14%') AS sub
JOIN Facilities f ON sub.facid = f.facid
JOIN Members m ON sub.memid = m.memid
WHERE sub.cost > 30
ORDER BY sub.cost DESC;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Massage Room 2', 'GUEST GUEST', 320),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Tennis Court 2', 'GUEST GUEST', 150),
 ('Tennis Court 1', 'GUEST GUEST', 75),
 ('Tennis Court 1', 'GUEST GUEST', 75),
 ('Tennis Court 2', 'GUEST GUEST', 75),
 ('Squash Court', 'GUEST GUEST', 70.0),
 ('Massage Room 1', 'Jemima Farrell', 39.6),
 ('Squash Court', 'GUEST GUEST', 35.0),
 ('Squash Court', 'GUEST GUEST', 35.0)]

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [17]:
%%sql
SELECT f.name AS facility_name,
        SUM(CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
            ELSE b.slots * f.membercost END) AS total_revenue
FROM Facilities AS f
JOIN Bookings AS b ON b.facid = f.facid
GROUP BY facility_name
HAVING total_revenue < 1000
ORDER BY total_revenue;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Table Tennis', 180), ('Snooker Table', 240), ('Pool Table', 270)]

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [31]:
%%sql
SELECT m.firstname || ' ' || m.surname AS member, r.firstname || ' ' || r.surname AS recommended_by
FROM Members m
LEFT JOIN Members r ON m.recommendedby= r.memid
WHERE m.memid != 0 AND recommended_by IS NOT NULL
ORDER BY m.surname ASC;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Florence Bader', 'Ponder Stibbons'),
 ('Anne Baker', 'Ponder Stibbons'),
 ('Timothy Baker', 'Jemima Farrell'),
 ('Tim Boothe', 'Tim Rownam'),
 ('Gerald Butters', 'Darren Smith'),
 ('Joan Coplin', 'Timothy Baker'),
 ('Erica Crumpet', 'Tracy Smith'),
 ('Nancy Dare', 'Janice Joplette'),
 ('Matthew Genting', 'Gerald Butters'),
 ('John Hunt', 'Millicent Purview'),
 ('David Jones', 'Janice Joplette'),
 ('Douglas Jones', 'David Jones'),
 ('Janice Joplette', 'Darren Smith'),
 ('Anna Mackenzie', 'Darren Smith'),
 ('Charles Owen', 'Darren Smith'),
 ('David Pinker', 'Jemima Farrell'),
 ('Millicent Purview', 'Tracy Smith'),
 ('Henrietta Rumney', 'Matthew Genting'),
 ('Ramnaresh Sarwin', 'Florence Bader'),
 ('Jack Smith', 'Darren Smith'),
 ('Ponder Stibbons', 'Burton Tracy'),
 ('Henry Worthington-Smyth', 'Tracy Smith')]

Q12: Find the facilities with their usage by member, but not guests

In [33]:
%%sql
SELECT f.name AS facilities, m.firstname || ' ' || m.surname AS member, COUNT(b.bookid) AS Member_usage
FROM Facilities AS f
JOIN Bookings AS b ON b.facid = f.facid
JOIN Members AS m ON b.memid = m.memid
WHERE m.memid !=0
GROUP BY facilities
ORDER BY facilities;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Badminton Court', 'Darren Smith', 344),
 ('Massage Room 1', 'Darren Smith', 421),
 ('Massage Room 2', 'Janice Joplette', 27),
 ('Pool Table', 'Darren Smith', 783),
 ('Snooker Table', 'Darren Smith', 421),
 ('Squash Court', 'Darren Smith', 195),
 ('Table Tennis', 'Darren Smith', 385),
 ('Tennis Court 1', 'Tracy Smith', 308),
 ('Tennis Court 2', 'Tim Rownam', 276)]

Q13: Find the facilities usage by month, but not guests

In [37]:
%%sql
SELECT f.name AS facilities,
        STRFTIME('%m', b.starttime) AS month,
        COUNT(b.bookid) AS usage_count
FROM Facilities AS f
JOIN Bookings AS b ON b.facid = f.facid
JOIN Members AS m ON b.memid = m.memid
WHERE m.memid !=0
GROUP BY facilities, month
ORDER BY month;

 * sqlite:///sqlite_db_pythonsqlite.db
Done.

[('Badminton Court', '07', 51),
 ('Massage Room 1', '07', 77),
 ('Massage Room 2', '07', 4),
 ('Pool Table', '07', 103),
 ('Snooker Table', '07', 68),
 ('Squash Court', '07', 23),
 ('Table Tennis', '07', 48),
 ('Tennis Court 1', '07', 65),
 ('Tennis Court 2', '07', 41),
 ('Badminton Court', '08', 132),
 ('Massage Room 1', '08', 153),
 ('Massage Room 2', '08', 9),
 ('Pool Table', '08', 272),
 ('Snooker Table', '08', 154),
 ('Squash Court', '08', 85),
 ('Table Tennis', '08', 143),
 ('Tennis Court 1', '08', 111),
 ('Tennis Court 2', '08', 109),
 ('Badminton Court', '09', 161),
 ('Massage Room 1', '09', 191),
 ('Massage Room 2', '09', 14),
 ('Pool Table', '09', 408),
 ('Snooker Table', '09', 199),
 ('Squash Court', '09', 87),
 ('Table Tennis', '09', 194),
 ('Tennis Court 1', '09', 132),
 ('Tennis Court 2', '09', 126)]